# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\Users\Dylan\Documents\Husky Robotics\PSoCWorkspaces\HuskyRobotics2017-2018\PioneerLSeries\PioneerLSeries.cydsn\PioneerLSeries.cyprj
# Date: Sat, 21 Apr 2018 21:21:42 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]


# Component constraints for E:\Users\Dylan\Documents\Husky Robotics\PSoCWorkspaces\HuskyRobotics2017-2018\PioneerLSeries\PioneerLSeries.cydsn\TopDesign\TopDesign.cysch
# Project: E:\Users\Dylan\Documents\Husky Robotics\PSoCWorkspaces\HuskyRobotics2017-2018\PioneerLSeries\PioneerLSeries.cydsn\PioneerLSeries.cyprj
# Date: Sat, 21 Apr 2018 21:21:38 GMT
